# continue跳过当前的循环，执行下个循环
for i in range(5):
    if i==3:
        continue
    print("第%d次"%i) #%d是格式化字符串的占位符
# 第0次
# 第1次
# 第2次
# 第4次
# 将整数i插入到字符串中


i = 3
print("第%d次" % i) #第3次

# 将浮点数f插入到字符串中
f = 1.23
print("浮点数为%.2f" % f) #浮点数为1.23

# 将字符串s插入到字符串中
s = "hello"
print("字符串为%s" % s) #字符串为hello

#————————————————————————————————————————————————————————————————————————————————————————————————————————-

for i in range(1, 10): # range()请看本章第五部分
    for j in range(i, 10):
        print('%d * %d = %d' % (i, j, i * j), end='\t')
    print('')  # 控制换行

# %d * %d = %d 是一个字符串
# % (i, j, i * j) 中，我们传递了一个元组(i, j, i * j)作为参数，按顺序将它们填充到字符串中的占位符中。

# 1 * 1 = 1	1 * 2 = 2	1 * 3 = 3	1 * 4 = 4	1 * 5 = 5	1 * 6 = 6	1 * 7 = 7	1 * 8 = 8	1 * 9 = 9	
# 2 * 2 = 4	2 * 3 = 6	2 * 4 = 8	2 * 5 = 10	2 * 6 = 12	2 * 7 = 14	2 * 8 = 16	2 * 9 = 18	
# 3 * 3 = 9	3 * 4 = 12	3 * 5 = 15	3 * 6 = 18	3 * 7 = 21	3 * 8 = 24	3 * 9 = 27	
# 4 * 4 = 16	4 * 5 = 20	4 * 6 = 24	4 * 7 = 28	4 * 8 = 32	4 * 9 = 36	
# 5 * 5 = 25	5 * 6 = 30	5 * 7 = 35	5 * 8 = 40	5 * 9 = 45	
# 6 * 6 = 36	6 * 7 = 42	6 * 8 = 48	6 * 9 = 54	
# 7 * 7 = 49	7 * 8 = 56	7 * 9 = 63	
# 8 * 8 = 64	8 * 9 = 72	
# 9 * 9 = 81	
