import numpy as np

a = np.array([
             [22, 33, 11, 44],
             [3, 2, 1, 4],
             [200, 300, 400, 100]])

a.sort()
print('排序后：\n',a)
# 排序后：
#  [[ 11  22  33  44]
#  [  1   2   3   4]
#  [100 200 300 400]]  数组list 内部排序

#a.sort(axis=0)
#print('axis=0排序（按列排序）\n',a)
# axis=0排序（按列排序）
#  [[  1   2   3   4]
#  [ 11  22  33  44]
#  [100 200 300 400]]  数组list 内部排序后，垂直上下排序

a.sort(axis=1)
print('axis=1排序(按行排序）\n',a)
# axis=1排序(按行排序）
#  [[ 11  22  33  44]
#  [  1   2   3   4]
#  [100 200 300 400]] 数组list 内部排序后，水平左右排序
