

from sklearn.linear_model import LogisticRegression   #逻辑回归 就在线性模型
from sklearn import preprocessing   # x要 归一化 ，先导入包
  

#1.数据 
   #删去0的值
   #0、1 已经赋值给 男女 

x=[[39,13, 0, 2174, 40], 
   [50, 12, 0, 0, 13, ], 
   [38, 9,0, 0, 40], 
   [53, 7,0,0, 40], 
   [28,13, 1, 0, 40], 
   [37, 14, 1, 0, 40], 
   [49, 5, 1, 0, 16], 
   [52, 9, 0, 0, 45], 
   [31, 14, 1, 14084, 45], 
   [42,13, 0,5178, 40]]

#是否大于50w收人 ，但是没有写
y =[0,0,0,0,0,0,0,1,1,1]  

#2.建模
x = preprocessing.minmax_scale(x)   #  净收人 0  与 万  差距太大。
model = LogisticRegression ()  #为什么要用分号

#3.训练
model.fit(x,y)

#4.预测
x1 =[[40, 10, 0, 0, 35]]
y1_pro = model.predict_proba(x1)  #  预测0和1可能性  [[2.87671886e-10 1.00000000e+00]]
y1 = model.predict(x1)  #
print(y1_pro,y1)     

# [[2.87671886e-10  1.00000000e+00]]  e 10d的多少次方  0 ， 1
# 表示模型预测为0的概率为 2.87671886e-10，预测为1的概率为 1.00000000e+00。














